{
  "ironic": 50272,
  "irony": 50266,
  "jesting": 50269,
  "joke": 50271,
  "joking": 50267,
  "kidding": 50265,
  "ridiculous": 50274,
  "sarcasm": 50273,
  "sarcastic": 50268,
  "teasing": 50270
}
